In [18]:
import pandas as pd

In [19]:
pd.read_csv("nba.csv", parse_dates = ["Birthday"])

nba = pd.read_csv("nba.csv", parse_dates = ["Birthday"])
nba.head(2)

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357

## Attributes

In [20]:
nba.shape

(450, 5)

In [21]:
nba.axes

[RangeIndex(start=0, stop=450, step=1),
 Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')]

In [22]:
nba.size

2250

## Methods

In [23]:
nba.sample(3)

,Name,Team,Position,Birthday,Salary
392,Jalen Lecque,Phoenix Suns,G,2000-06-13,898310
144,Kentavious Caldwell-Pope,Los Angeles Lakers,SG,1993-02-18,8089282
294,Jordan Bell,Minnesota Timberwolves,C,1995-01-07,1620564

In [24]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [25]:
nba.count().sum()

2250

In [26]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [27]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [28]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

## Access Column

In [30]:
nba.Name

nba["Name"]

0        Shake Milton
1      Christian Wood
2       PJ Washington
3        Derrick Rose
4       Marial Shayok
            ...
445     Austin Rivers
446       Harry Giles
447       Robin Lopez
448     Collin Sexton
449       Ricky Rubio
Name: Name, Length: 450, dtype: object

In [32]:
nba["Team"].head()

0    Philadelphia 76ers
1       Detroit Pistons
2     Charlotte Hornets
3       Detroit Pistons
4    Philadelphia 76ers
Name: Team, dtype: object

In [35]:
nba[["Team", "Birthday"]]

nba[["Birthday", "Team"]]

      Birthday                 Team
0   1996-09-26   Philadelphia 76ers
1   1995-09-27      Detroit Pistons
2   1998-08-23    Charlotte Hornets
3   1988-10-04      Detroit Pistons
4   1995-07-26   Philadelphia 76ers
..         ...                  ...
445 1992-08-01      Houston Rockets
446 1998-04-22     Sacramento Kings
447 1988-04-01      Milwaukee Bucks
448 1999-01-04  Cleveland Cavaliers
449 1990-10-21         Phoenix Suns

[450 rows x 2 columns]

In [14]:
nba = pd.read_csv(
    "nba.csv",
    parse_dates = ["Birthday"],
    index_col = "Name"
)

nba.head()

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

## Accessing Row by Label

In [16]:
nba.loc["Kawhi Leonard"]

Team        Los Angeles Clippers
Position                      SF
Birthday     1991-06-29 00:00:00
Salary                  32742000
Name: Kawhi Leonard, dtype: object

In [17]:
nba.loc[["Kawhi Leonard", "Paul George"]]

                               Team Position   Birthday    Salary
Name
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556

In [ ]:
nba.loc[["Kawhi Leonard", "Paul George"]]